uat_chat/Catalogs/юкГруппыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>юкГруппыТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/юкГруппыТС/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьШильдиков") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьШильдиков", 
			НСтр("ru='Шильдики для журнала'"), 
			ПечатьШильдиков(МассивОбъектов[0], ОбъектыПечати)
		);
		
	КонецЕсли;
КонецПроцедуры

Функция ПечатьШильдиков(пСсылка, пОбъектыПечати)
	вТабличныйДокумент = Новый ТабличныйДокумент;
	вТабличныйДокумент.АвтоМасштаб = Ложь;
	вТабличныйДокумент.МасштабПечати = 100;
	вТабличныйДокумент.ОтображатьСетку = Ложь;
	вТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	мСтруктураДанныхИМакет = ПолучитьМассивТС(пСсылка);
	мМассивТранспортныхСредств = мСтруктураДанныхИМакет.МассивТС;
	мОбластьЯчейка = мСтруктураДанныхИМакет.Область;
	мЧислоСтрок = ?(Цел(мМассивТранспортныхСредств.Количество() / 6) = мМассивТранспортныхСредств.Количество(), мМассивТранспортныхСредств.Количество(), Цел(мМассивТранспортныхСредств.Количество() / 4) + 1);
	мВыведено = 1;
	
	Для Итр = 1 По мЧислоСтрок Цикл
		Для Джитр = 1 По 6 Цикл
			мЭлементМассива = мМассивТранспортныхСредств[(Итр-1) + (Джитр-1)];
			мОбластьЯчейка.Параметры.Заполнить(мЭлементМассива);
			Если Джитр = 1 Тогда
				вТабличныйДокумент.Вывести(мОбластьЯчейка);
			Иначе
				вТабличныйДокумент.Присоединить(мОбластьЯчейка);
			КонецЕсли;
			мВыведено = мВыведено + 1;
			Если мВыведено = мМассивТранспортныхСредств.Количество() Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если мВыведено = мМассивТранспортныхСредств.Количество() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат вТабличныйДокумент;
КонецФункции

Функция ПолучитьМассивТС(пГруппаТС)
	вМассив = Новый Массив;
	
	мЗапрос = Новый Запрос("ВЫБРАТЬ
	|	юкГруппыТСТаблицаТС.ТС КАК ТС,
	|	юкГруппыТСТаблицаТС.ТС.ГаражныйНомер КАК ГаражныйНомер,
	|	юкГруппыТСТаблицаТС.ТС.ГосударственныйНомер КАК ГосударственныйНомер
	|ИЗ
	|	Справочник.юкГруппыТС.ТаблицаТС КАК юкГруппыТСТаблицаТС
	|ГДЕ юкГруппыТСТаблицаТС.Ссылка = &Ссылка");
	
	мЗапрос.УстановитьПараметр("Ссылка", пГруппаТС);
	мРезультат = мЗапрос.Выполнить().Выбрать();
	Пока мРезультат.Следующий() Цикл
		мСтруктура = Новый Структура("ТС, ГаражныйНомер, ГосударственныйНомер");
		ЗаполнитьЗначенияСвойств(мСтруктура, мРезультат);
		мСтруктура.ГосударственныйНомер = СтрЗаменить(мРезультат.ГосударственныйНомер, " ", "");
		вМассив.Добавить(мСтруктура);
	КонецЦикла;
	мМакет = Справочники.юкГруппыТС.ПолучитьМакет("Макет");
	мОбласть = мМакет.ПолучитьОбласть("ОбластьЯчейка");
	вСтруктура = Новый Структура("МассивТС, Область", вМассив, мОбласть);
	Возврат вСтруктура;
КонецФункции
